AnandSingh/lpc54s018-sdk/middleware/mcu-boot/targets/LPC54S018M/src/startup/gcc/startup_LPC54S018M.S
    .long   0
    .long   0
    .long   0
    .long   0
    .long   0
    .long   0
    .long   0
    .long   0
    .long   0
    .long   0
    .long   0
    .long   0
    .long   0

    .size    __isr_vector, . - __isr_vector

#ifndef IMG_BAUDRATE
#define IMG_BAUDRATE 0
#endif

__image_header:
    .long   0xFEEDA5A5                                      /* (0x00, 0x160) Header Marker */
    #ifdef XIP_IMAGE
          #ifdef ADD_CRC
          .long   0x2                                       /* (0x04) Image Type */
          #else
          .long   0x3                                       /* (0x04) Image Type */
          #endif
    #else
          #ifdef ADD_CRC
          .long   0x0                                       /* (0x04) Image Type */
          #else
          .long   0x1                                       /* (0x04) Image Type */
          #endif    
    #endif
    
    #ifdef XIP_IMAGE
          .long   0x10000000                                /* (0x08) Load_address */
    #else
          .long   0x20000000                                /* (0x08) Load_address */
    #endif
    .long   __DATA_END - 0x20000000 - 4                                   /* (0x0C) load_length */
    .long   0                                               /* (0x10) CRC value (only applicable to NON Non-secure images) */
    .long   0                                               /* (0x14) Version (only applicable to DUAL_ENH image type */
    .long   0                                               /* (0x18) EMC static memory configuration settings, required for EMC boot */
    .long   IMG_BAUDRATE                                    /* image baudrate */
    .long   0                                               /* Reserved */
    .long   0xEDDC94BD                                      /* (0x24) Image_marker */
    .long   0                                               /* (0x28) SBZ */
    .long   0                                               /* (0x2C) reserved */
     #ifdef W25Q128JVFM
     /* SPI Descriptor - W25Q128JVFM */
    .long   0x00000000                                      /* 0xFFFFFFFF to default 1-bit SPI mode   ;DevStrAdr */
    .long   0x001870EF                                      /* mfgId + extCount */
    .long   0x00000000                                      /* extid 0-3 */
    .long   0x00000000                                      /* extid 4-7 */
    .long   0x0001001D                                      /* caps */
    .long   0x00000100                                      /* Blks + RESV1 */
    .long   0x00010000                                      /* blkSize */
    .long   0x00000000                                      /* subBlks + subBlkSize */
    .long   0x00000100                                      /* pageSize + RESV2 */
    .long   0x00003F00                                      /* maxReadSize */
    .long   0x68506850                                      /* maxClkRate,maxReadRate,maxHSReadRate,maxProgramRate */
    .long   0x04030050                                      /* maxHSProgramRate,initDeInitFxId,clearStatusFxId,getStatusFxId, */
    .long   0x14110D09                                      /* setStatusFxId,setOptionsFxId,getReadCmdFxId,getWriteCmdFxId */
    #endif 

     #ifdef MXL12835F
     /* SPI Descriptor - MXL12835F */
    .long   0x00000000                                      /* 0xFFFFFFFF to default 1-bit SPI mode  ;DevStrAdr */
    .long   0x001820C2                                      /* mfgId + extCount */
    .long   0x00000000                                      /* extid 0-3 */
    .long   0x00000000                                      /* extid 4-7 */
    .long   0x0001001D                                      /* caps */
    .long   0x00000100                                      /* Blks + RESV1 */
    .long   0x00010000                                      /* blkSize */
    .long   0x00000000                                      /* subBlks + subBlkSize */
    .long   0x00000100                                      /* pageSize + RESV2 */
    .long   0x00003F00                                      /* maxReadSize */
    .long   0x68506850                                      /* maxClkRate,maxReadRate,maxHSReadRate,maxProgramRate */
    .long   0x06030050                                      /* maxHSProgramRate,initDeInitFxId,clearStatusFxId,getStatusFxId */
    .long   0x14110F0B                                      /* setStatusFxId,setOptionsFxId,getReadCmdFxId,getWriteCmdFxId */
    #endif
    .text
    .thumb

/* Reset Handler */
    .thumb_func
    .align 2
    .globl   Reset_Handler
    .weak    Reset_Handler
    .type    Reset_Handler, %function
Reset_Handler:

#ifndef __NO_SYSTEM_INIT
    ldr   r0,=SystemInit
    blx   r0
#endif
/*     Loop to copy data from read only memory to RAM. The ranges
 *      of copy from/to are specified by following symbols evaluated in
 *      linker script.
 *      __etext: End of code section, i.e., begin of data sections to copy from.
 *      __data_start__/__data_end__: RAM address range that data should be
 *      copied to. Both must be aligned to 4 bytes boundary.  */

    ldr    r1, =__etext
    ldr    r2, =__data_start__
    ldr    r3, =__data_end__

#if 1
/* Here are two copies of loop implemenations. First one favors code size
 * and the second one favors performance. Default uses the first one.
 * Change to "#if 0" to use the second one */
.LC0:
    cmp     r2, r3
    ittt    lt
    ldrlt   r0, [r1], #4
    strlt   r0, [r2], #4
    blt    .LC0
#else
    subs    r3, r2
    ble    .LC1
.LC0:
    subs    r3, #4
    ldr    r0, [r1, r3]
    str    r0, [r2, r3]
    bgt    .LC0
.LC1:
#endif

#ifdef __STARTUP_CLEAR_BSS
/*     This part of work usually is done in C library startup code. Otherwise,
 *     define this macro to enable it in this startup.
 *
 *     Loop to zero out BSS section, which uses following symbols
 *     in linker script:
 *      __bss_start__: start of BSS section. Must align to 4
 *      __bss_end__: end of BSS section. Must align to 4
 */
    ldr r1, =__bss_start__
    ldr r2, =__bss_end__

    movs    r0, 0
.LC2:
    cmp     r1, r2
    itt    lt
    strlt   r0, [r1], #4
    blt    .LC2
#endif /* __STARTUP_CLEAR_BSS */

